"""
Задание 6.

Создать  НЕ программно (вручную) текстовый файл test_file.txt, заполнить его тремя строками:
«сетевое программирование», «сокет», «декоратор».

Принудительно программно открыть файл в формате Unicode и вывести его содержимое.
Что это значит? Это значит, что при чтении файла вы должны явно указать кодировку utf-8
и файл должен открыться у ЛЮБОГО!!! человека при запуске вашего скрипта.

При сдаче задания в папке должен лежать текстовый файл!

Это значит вы должны предусмотреть случай, что вы по дефолту записали файл в cp1251,
а прочитать пытаетесь в utf-8.

Преподаватель будет запускать ваш скрипт и ошибок НЕ ДОЛЖНО появиться!

Подсказки:
--- обратите внимание, что заполнять файл вы можете в любой кодировке
но открыть нужно ИМЕННО!!! в формате Unicode (utf-8)
--- обратите внимание на чтение файла в режиме rb
для последующей переконвертации в нужную кодировку

НАРУШЕНИЕ обозначенных условий - задание не выполнено!!!
"""

import chardet

file_name = "test_file.txt"


def convert_text(file):
    with open(file, "rb") as f_old:
        data = f_old.read()
    converted_text = data.decode(chardet.detect(data)['encoding'])
    new_file = f"{file.split('.')[0]}_converted.{file.split('.')[1]}"
    with open(new_file, "wb") as f_new:
        f_new.write(converted_text.encode("utf-8"))

    return new_file


with open(convert_text(file_name), "r", encoding="utf-8") as f:
    print(f.read())
